Repository: MediaKraken/MediaKraken_Deployment
Catalog: docker/buggenie/thebuggenie-docker/*/modules/auth_ldap/i18n/*/strings.xlf
Languages: ru_ru

source: Failed to connect to server
ru_ru: Не удалось соединиться с сервером

source: Failed to bind:
ru_ru: Не удалось привязать:

source: Search failed:
ru_ru: Поиск не удался:

source: User does not exist in the directory
ru_ru: Пользователь не существует в этой директории

source: This user was found multiple times in the directory, please contact your administrator
ru_ru: Этот пользователь был несколько раз найден в каталоге, обратитесь к администратору

source: Search failed
ru_ru: Поиск не удался

source: You are not a member of a group allowed to log in
ru_ru: Вы не являетесь членом группы, которой разрешен вход

source: Your password was not accepted by the server
ru_ru: Ваш пароль не подтвержден сервером

source: HTTP authentication internal error.
ru_ru: Внутренняя ошибка аутентификации HTTP.

source: HTTP integrated authentication is enabled but the HTTP header has not been provided by the web server.
ru_ru: Включена встроенная проверка подлинности HTTP, но заголовок HTTP не был получен от веб-сервера.

source: Failed to validate groups
ru_ru: Не удалось проверить группы

source: HTTP Authentication Header not present
ru_ru: Отсутствует заголовок аутентификации HTTP

source: Connection test successful. HTTP integrated authentication states your username is "USER"
ru_ru: Тест соединения успешен. Встроенная проверка подлинности HTTP сообщает, что ваше имя пользователя это "Пользователь"

source: Connection test successful
ru_ru: Тест соединения пройден

source: Some of the groups you specified don't exist
ru_ru: Некоторые группы отсутствуют

source: The following groups for the group restriction could not be found: %groups
ru_ru: Следующие группы для групповых ограничений не найдены: %groups

source: Pruning failed
ru_ru: Удалить не удалось

source: Pruning successful! %del users deleted
ru_ru: Удаление успешно! %del пользователей удалено

source: Import failed
ru_ru: Импорт не удался

source: Import successful! %imp users imported, %upd users updated from LDAP
ru_ru: Импорт завершён успешно! Импортировано %imp пользователей, %upd обновлено из LDAP

source: Use this page to set up the connection details for your LDAP or Active Directory server. It is highly recommended that you read the online help before use, as misconfiguration may prevent you from accessing configuration pages to rectify issues.
ru_ru: Эта страница используется для настройки подключении для сервера LDAP или Active Directory. Настоятельно рекомендуется, чтобы вы прочитали онлайн справку перед изменением, потому как неправильная настройка может заблокировать вам доступ к страницам конфигурации по устранению проблем.

source: View the online documentation
ru_ru: Показать онлайн-документацию

source: LDAP support is not installed
ru_ru: Поддержка LDAP не установлена

source: The PHP LDAP extension is required to use this functionality. As this module is not installed, all functionality on this page has been disabled.
ru_ru: Для использования этой функции требуется расширение LDAP для PHP. Поскольку этот модуль не установлен, все функции на этой странице были отключены.

source: Important information
ru_ru: Важная информация

source: When you enable LDAP as your authentication backend in Authentication configuration, you will lose access to all accounts which do not also exist in the LDAP database. This may mean you lose administrative access.
ru_ru: При включении LDAP как ваш бэкэнд проверки подлинности в конфигурации проверки подлинности, вы потеряете доступ ко всем учетным записям, которые не существуют в базе данных LDAP. Это может означать, что вы потеряете административный доступ.

source: To resolve this issue, either import all users using the tool on this page and make one an administrator using Users configuration, or create a user with the same username as one in LDAP and make that one an administrator.
ru_ru: Чтобы решить эту проблему, либо импортируйте всех пользователей с помощью инструмента на этой странице и сделать одного администратором, используя Конфигурацию пользователей, или создайте пользователя с тем же именем пользователя, как и в LDAP и сделайте его администратором.

source: Connection details
ru_ru: Детали соединения

source: Hostname
ru_ru: Имя хоста

source: Use URL syntax (ldap://hostname:port). If your server requires SSL, use ldaps://hostname/ in this field.
ru_ru: Используйте синтаксис ссылки (ldap://hostname:port). Если ваш сервер требует SSL шифрование, используйте ldaps://hostname/ в этом поле.

source: Base DN
ru_ru: Базовый DN

source: Object DN attribute
ru_ru: Атрибут DN объекта

source: Enter the name of the property containing the distinguished name of an object. On Linux systems this may be entrydn (which is the default value if this is left blank), on Active Directory it is distinguishedName.
ru_ru: Введите имя свойства содержащее отличающееся имя объекта. На системах Linux оно может быть entryDN (как значение по умолчанию оно останеться пустым), в Active Directory оно будет отличающимся имененм.

source: User class
ru_ru: Класс пользователя

source: Enter the value to check for in objectClass for users. Leave blank to use the default of person
ru_ru: Введите значение для установки Класса Объекта для пользователей. Оставьте поле пустым, чтобы использовать стандарт персоны

source: Username attribute
ru_ru: Атрибут пользователя

source: This field should contain the name of the attribute where the username is stored, such as uid.
ru_ru: Это поле должно содержать имя атрибута, где хранится имя пользователя, например uid.

source: Full name attribute
ru_ru: Полное имя атрибута

source: Given name attribute
ru_ru: Имя атрибута

source: Email address attribute
ru_ru: Атрибуты е-mail адреса

source: Group class
ru_ru: Класс группы

source: Enter the value to check for in objectClass for groups. Leave blank to use the default of group
ru_ru: Введите значение для установки Класса Объекта для групп. Оставьте поле пустым, чтобы использовать стандарт группы

source: Group members attribute
ru_ru: Группировать членские атрибуты

source: This field should contain the name of the attribute where the list of members of a group is stored, such as uniqueMember.
ru_ru: Это поле должно содержать имя атрибута, где хранится список членов группы, например uniqueMember.

source: Allowed groups
ru_ru: Разрешенные группы

source: You may wish to restrict access to users who belong to certain groups in LDAP. If so, write a comma separated list of group names here. Leave blank to disable this feature.
ru_ru: Вы можете ограничить доступ пользователям, которые принадлежат к определенным группам в LDAP. Если да, напишите список, разделенных запятыми, имен групп здесь. Оставьте пустым, чтобы отключить эту функцию.

source: Control username
ru_ru: Имя пользователя управления

source: Control user password
ru_ru: Пароль пользователя управления

source: Please insert the authentication details for a user who can access all LDAP records. Only read only access is necessary, and for an anonyous bind leave this blank.
ru_ru: Пожалуйста, введите данные проверки подлинности для пользователя, который имеет доступ ко всем записям LDAP. Необходимы только доступ чтения, для анонимной привязки оставьте это поле пустым.

source: Use HTTP Integrated Authentication
ru_ru: Встроенная проверка подлинности HTTP

source: Activate to enabled automatic user login using HTTP integrated authentication. This requires your web server to be authenticating the user (e.g. HTTP Basic Authentication, Kerberos etc).
ru_ru: Активируйте, чтобы включить автоматический вход с помощью встроенной проверки подлинности HTTP. Это требует чтобы ваш веб-сервер был авторизованным пользователем (например Базовая аутентификация доступа HTTP, Kerberos и т.д.).

source: HTTP header field
ru_ru: Поле заголовка HTTP

source: If using HTTP integrated authentication specify the HTTP header field that will contain the user name.
ru_ru: Если используется встроенная проверки подлинности HTTP, укажите в поле заголовок HTTP, в котором будет содержиться имя пользователя.

source: Click "%save" to save the settings
ru_ru: Нажмите "%save", чтобы сохранить параметры

source: Save
ru_ru: Сохранить

source: Test connection
ru_ru: Проверить соединение

source: After configuring and saving your connection settings, you should test your connection to the LDAP server. This test does not check whether the DN and attributes can allow The Bug Genie to correctly find users, but it will give an indication if The Bug Genie can talk to your LDAP server, and if any groups you specify exist. If HTTP integrated authentication is enabled, this will also test that your web server is providing the REMOTE_USER header.
ru_ru: После настройки и сохранения параметров подключения, необходимо проверить подключение к LDAP-серверу. Этот тест не проверяет чтобы атрибуты или DN позволяли The Bug Genie правильно найти пользователей, но он даст указание, если The Bug Genie может общаться с вашим LDAP сервером и существуют ли указанные группы. Если включена встроенная проверка подлинности HTTP то также будет проверено, чтобы ваш веб-сервер передавал REMOTE_USER заголовок.

source: Import all users
ru_ru: Импортировать всех пользователей

source: You can import all users who can log in from LDAP into The Bug Genie with this tool. This will not let them log in without switching to LDAP Authentication. We recomemnd you do this before switching over, and make at least one of the new users an administrator. Already existing users with the same username will be updated.
ru_ru: Вы можете импортировать всех пользователей, которые могут войти LDAP в The Bug Genie с помощью этого инструмента. Это не позволит им войти в систему без переключения на аутентификацию по LDAP. Мы рекомендуем вам сделать это до переключения и сделать по крайней мере одного из новых пользователей администратором. Уже существующие пользователи с тем же именем пользователя будут обновлены.

source: Import users
ru_ru: Импорт пользователей

source: Prune users
ru_ru: Удалить пользователи

source: To remove the data from The Bug Genie of users who can no longer log in via LDAP, run this tool. These users would not be able to log in anyway, but it will keep your user list clean. The guest user is not affected, but it may affect your current user - if this is deleted you will be logged out.
ru_ru: Чтобы удалить данные из The Bug Genie о пользователях, которые больше не могут войти через LDAP, запустите этот инструмент. Эти пользователи не смогут войти в любом случае, но зато ваш список пользователей будет чистым. Пользователя "Гость" это не затронет, но это может повлиять на ваш текущий пользователь - если это произойдет вы будите деавторизованы.
